Repository: elmosca/proyecto_flutter_supabase
Catalog: frontend/lib/l10n/app_*.arb
Languages: es

# appTitle
source: TFG Management System
es: Sistema de Gestión TFG

source: Login
es: Iniciar Sesión

source: Email
es: Correo Electrónico

source: Password
es: Contraseña

source: Login error
es: Error de inicio de sesión. Por favor, verifica tus credenciales.

source: Dashboard
es: Panel Principal

source: Projects
es: Proyectos

source: Tasks
es: Tareas

source: Profile
es: Perfil

source: Logout
es: Cerrar Sesión

source: Student
es: Estudiante

# admin
source: Administrator
es: Administrador

source: Welcome
es: Bienvenido

source: Loading...
es: Cargando...

source: Success
es: Éxito

source: Cancel
es: Cancelar

source: Save
es: Guardar

source: Edit
es: Editar

# taskCreatedSuccess
source: Task created successfully
es: Tarea creada exitosamente

# taskUpdatedSuccess
source: Task updated successfully
es: Tarea actualizada exitosamente

# taskStatusUpdatedSuccess
source: Task status updated
es: Estado de tarea actualizado

# taskDeletedSuccess
source: Task deleted successfully
es: Tarea eliminada exitosamente

source: Task not found
es: Tarea no encontrada

# testCredentialsTitle
source: Test credentials
es: Credenciales de prueba

# testCredentialsAdmin
source: 👨‍💼 Admin
es: 👨‍💼 Administrador

# testCredentialsStudent
source: 👨‍🎓 Student
es: 👨‍🎓 Estudiante

source: Copy
es: Copiar

# copiedToClipboard
source: Copied to clipboard: {value}
es: Copiado al portapapeles: {value}

source: Delete
es: Eliminar

source: Create
es: Crear

source: Search
es: Buscar

# noData
source: No data available
es: No hay datos disponibles

source: Connection error
es: Error de conexión. Por favor, verifica tu conexión a internet.

# anteprojectFormTitle
source: Create Anteproject
es: Crear Anteproyecto

# anteprojectEditFormTitle
source: Edit Anteproject
es: Editar Anteproyecto

# anteprojectType
source: Project Type
es: Tipo de proyecto

# anteprojectDescription
source: Description
es: Descripción

# anteprojectAcademicYear
source: Academic Year (e.g., 2024-2025)
es: Año académico (e.g., 2024-2025)

# anteprojectExpectedResults
source: Expected Results (JSON)
es: Resultados esperados (JSON)

# anteprojectTimeline
source: Timeline (JSON)
es: Temporalización (JSON)

# anteprojectCreateButton
source: Create Anteproject
es: Crear anteproyecto

# anteprojectUpdateButton
source: Update anteproyecto
es: Actualizar anteproyecto

# anteprojectDeleteButton
source: Delete
es: Eliminar

# anteprojectDeleteTitle
source: Delete Anteproject
es: Eliminar Anteproyecto

# anteprojectDeleteMessage
source: Are you sure you want to delete this anteproyecto? This action cannot be undone.
es: ¿Estás seguro de que quieres eliminar este anteproyecto? Esta acción no se puede deshacer.

# anteprojectCreatedSuccess
source: Anteproject created successfully
es: Anteproyecto creado exitosamente

# timelineWillBeEstablishedByTutor
source: The timeline will be established by your assigned tutor using a calendar tool.
es: La temporalización será establecida por tu tutor asignado usando una herramienta de calendario.

source: Download example PDF
es: Descargar ejemplo PDF

source: Load Template
es: Cargar Plantilla

# anteprojectUpdatedSuccess
source: Anteproject updated successfully
es: Anteproyecto actualizado exitosamente

# anteprojectInvalidTutorId
source: Invalid Tutor ID
es: Tutor ID inválido

# anteprojectTitleRequired
source: Title is required
es: El título es obligatorio

# anteprojectDescriptionRequired
source: Description is required
es: La descripción es obligatoria

# anteprojectAcademicYearRequired
source: Academic year is required
es: El año académico es obligatorio

# anteprojectTutorIdRequired
source: Tutor ID is required
es: El Tutor ID es obligatorio

# anteprojectTutorIdNumeric
source: Tutor ID must be numeric
es: El Tutor ID debe ser numérico

# anteprojectsListTitle
source: My Anteprojects
es: Mis Anteproyectos

# anteprojectsListRefresh
source: Refresh list
es: Actualizar lista

# anteprojectsListError
source: Error loading anteproyectos
es: Error al cargar anteproyectos

# anteprojectsListRetry
source: Retry
es: Reintentar

# anteprojectsListEmpty
source: You have no anteproyectos
es: No tienes anteproyectos

# anteprojectsListEmptySubtitle
source: Create your first anteproyecto to get started
es: Crea tu primer anteproyecto para comenzar

# anteprojectsListUnknownState
source: Unknown state
es: Estado no reconocido

# anteprojectsListEdit
source: Edit
es: Editar

# anteprojectDeleteTooltip
source: Delete anteproyecto
es: Eliminar anteproyecto

# commentsAddComment
source: Add comment
es: Añadir comentario

# commentsWriteComment
source: Write your comment...
es: Escribe tu comentario...

# commentsSend
source: Send
es: Enviar

# commentsCancel
source: Cancel
es: Cancelar

# commentsInternal
source: Internal comment
es: Comentario interno

# commentsPublic
source: Public comment
es: Comentario público

# commentsNoComments
source: No comments
es: No hay comentarios

# commentsAddFirst
source: Be the first to comment
es: Sé el primero en comentar

# commentsError
source: Error loading comments
es: Error al cargar comentarios

# commentsErrorAdd
source: Error adding comment
es: Error al añadir comentario

# commentsSuccess
source: Comment added successfully
es: Comentario añadido correctamente

# commentsDelete
source: Delete comment
es: Eliminar comentario

# commentsDeleteConfirm
source: Are you sure you want to delete this comment?
es: ¿Estás seguro de que quieres eliminar este comentario?

# commentsEdit
source: Edit comment
es: Editar comentario

# commentsSave
source: Save changes
es: Guardar cambios

# commentsAuthor
source: Author
es: Autor

# commentsDate
source: Date
es: Fecha

# commentsContent
source: Content
es: Contenido

# commentsContentRequired
source: Comment content is required
es: El contenido del comentario es obligatorio

# commentsContentMinLength
source: Comment must be at least 3 characters
es: El comentario debe tener al menos 3 caracteres

# commentsContentMaxLength
source: Comment cannot exceed 1000 characters
es: El comentario no puede exceder 1000 caracteres

source: Unknown user
es: Usuario desconocido

source: Just now
es: Ahora

# anteprojectStatusLabel
source: Status: {status}
es: Estado: {status}

# anteprojectExpectedResultsHint
source: Example milestone1 Description
es: Ejemplo milestone1 Descripción

# anteprojectTimelineHint
source: Example phase1 Description
es: Ejemplo phase1 Descripción

# dashboardStudent
source: Student Dashboard
es: Dashboard Estudiante

source: My Anteprojects
es: Mis Anteproyectos

source: View All
es: Ver todos

source: Pending Anteprojects
es: Anteproyectos Pendientes

source: Assigned Students
es: Estudiantes Asignados

source: No Anteprojects
es: No tienes anteproyectos creados. ¡Crea tu primer anteproyecto!

source: Pending Tasks
es: Tareas Pendientes

source: View All Tasks
es: Ver todas

source: No Pending Tasks
es: No tienes tareas pendientes. ¡Excelente trabajo!

# systemInfo
source: System Information
es: Información del Sistema

# backendLabel
source: Backend
es: Backend: {url}

# platformLabel
source: Platform
es: Plataforma: {platform}

# versionLabel
source: Version
es: Versión: {version}

source: Connected to server
es: Estado: Conectado al servidor de red

# dashboardAdminUsersManagement
source: Users Management
es: Gestión de Usuarios

# dashboardTutor
source: Tutor Dashboard
es: Dashboard de Tutor

# dashboardAdmin
source: Admin Dashboard
es: Dashboard de Administrador

source: Coming Soon
es: Próximamente

# noProjectsAvailableForTasks
source: No projects available for creating tasks. Make sure your anteproject is approved.
es: No hay proyectos disponibles para crear tareas. Asegúrate de que tu anteproyecto esté aprobado.

# mustSelectProjectForTask
source: You must select a project to create the task
es: Debe seleccionar un proyecto para crear la tarea

source: My Projects
es: Mis Proyectos

# noProjectsAssigned
source: You have no projects assigned. Contact your tutor.
es: No tienes proyectos asignados. Contacta con tu tutor.

source: Open Supabase Studio
es: Abrir Supabase Studio

# supabaseStudioDescription
source: Direct access to database administration panel
es: Acceso directo al panel de administración de la base de datos

source: Open Inbucket
es: Abrir Inbucket

source: Total Users
es: Usuarios Totales

source: Active Projects
es: Proyectos Activos

source: Tutors
es: Tutores

source: No users
es: No hay usuarios

source: System Status
es: Estado del Sistema

source: Close
es: Cerrar

# dashboardTutorMyAnteprojects
source: My Anteprojects
es: Mis Anteproyectos

source: Language
es: Idioma

source: Spanish
es: Español

source: English
es: Inglés

# serverInfo
source: Server Information
es: Información del Servidor

source: Server URL
es: URL del Servidor

source: Version
es: Versión

source: Test Credentials
es: Credenciales de Prueba

source: Student Email
es: Correo del Estudiante

source: Tutor Email
es: Correo del Tutor

source: Admin Email
es: Correo del Administrador

source: Test Password
es: Contraseña de Prueba

# loginSuccessTitle
source: Login Successful
es: ✅ Login Exitoso

source: Copy to Clipboard
es: Copiar al portapapeles

source: Validation Error
es: Error de validación

# formValidationError
source: Please correct the errors in the form
es: Por favor, corrige los errores en el formulario

source: Network error
es: Error de red

# networkErrorMessage
source: Could not connect to server. Check your internet connection.
es: No se pudo conectar al servidor. Verifica tu conexión a internet.

source: Server error
es: Error del servidor

# serverErrorMessage
source: Server could not process the request. Try again later.
es: El servidor no pudo procesar la solicitud. Inténtalo de nuevo más tarde.

source: Unknown error
es: Error desconocido

# unknownErrorMessage
source: An unexpected error occurred. Please try again.
es: Ocurrió un error inesperado. Por favor, inténtalo de nuevo.

source: Confirm
es: Confirmar

source: Yes
es: Sí

# fieldRequired
source: This field is required
es: Este campo es obligatorio

# fieldTooShort
source: This field is too short
es: Este campo es demasiado corto

# fieldTooLong
source: This field is too long
es: Este campo es demasiado largo

# invalidEmail
source: Email format is not valid
es: El formato del email no es válido

# invalidUrl
source: URL does not have a valid format
es: La URL no tiene un formato válido

# invalidNumber
source: Value must be a valid number
es: El valor debe ser un número válido

# invalidJson
source: JSON format is not valid
es: El formato JSON no es válido

source: Operation in progress
es: Operación en progreso...

source: Operation completed
es: Operación completada

source: Operation failed
es: La operación falló

# taskFormTitle
source: Task Form
es: Formulario de Tarea

# taskEditFormTitle
source: Edit Task
es: Editar Tarea

# taskTitle
source: Title
es: Título

# taskDescription
source: Description
es: Descripción

# taskStatus
source: Status
es: Estado

# taskComplexity
source: Complexity
es: Complejidad

# taskDueDate
source: Due Date
es: Fecha de Vencimiento

# taskEstimatedHours
source: Estimated Hours
es: Horas Estimadas

# taskTags
source: Tags
es: Etiquetas

# taskCreateButton
source: Create Task
es: Crear Tarea

# taskUpdateButton
source: Update Task
es: Actualizar Tarea

# taskTitleRequired
source: Title is required
es: El título es obligatorio

# taskDescriptionRequired
source: Description is required
es: La descripción es obligatoria

# taskStatusPending
source: Pending
es: Pendiente

# taskStatusInProgress
source: In Progress
es: En Progreso

# taskStatusCompleted
source: Completed
es: Completada

# taskComplexityMedium
source: Medium
es: Media

# taskComplexityComplex
source: Complex
es: Compleja

# tasksListTitle
source: Tasks List
es: Lista de Tareas

# tasksListEmpty
source: No tasks available
es: No hay tareas disponibles

# tasksListRefresh
source: Refresh Tasks
es: Actualizar

# kanbanBoardTitle
source: Kanban Board
es: Tablero Kanban

# kanbanColumnPending
source: Pending
es: Pendientes

# kanbanColumnInProgress
source: In Progress
es: En Progreso

# kanbanColumnCompleted
source: Completed
es: Completadas

# taskReorderedSuccess
source: Task reordered successfully
es: Tarea reordenada exitosamente

# taskPositionUpdatedSuccess
source: Task position updated
es: Posición de tarea actualizada

# movingTask
source: Moving...
es: Moviendo...

# taskStatusUpdatedNotification
source: Task status updated
es: Estado de tarea actualizado

# taskStatusChangedMessage
source: Task \
es: La tarea "{taskTitle}" cambió a estado: {status}

# taskAssignedNotification
source: Task assigned
es: Tarea asignada

# taskAssignedMessage
source: You have been assigned the task: \
es: Se te ha asignado la tarea: "{taskTitle}"

# newCommentNotification
source: New comment on task
es: Nuevo comentario en tarea

# newCommentMessage
source: New comment on \
es: Nuevo comentario en "{taskTitle}": {commentPreview}

source: Select Date
es: Seleccionar fecha

source: Create Task
es: Crear Tarea

source: Approval Workflow
es: Flujo de Aprobación

source: Pending Approvals
es: Aprobaciones Pendientes

source: Reviewed Anteprojects
es: Anteproyectos Revisados

source: Approve Anteproject
es: Aprobar Anteproyecto

source: Reject Anteproject
es: Rechazar Anteproyecto

source: Request Changes
es: Solicitar Cambios

source: Approval Comments
es: Comentarios de Aprobación

# approvalCommentsHint
source: Comments about the approval...
es: Comentarios sobre la aprobación...

source: Rejection Comments
es: Comentarios de Rechazo

# rejectionCommentsHint
source: Reason for rejection...
es: Motivo del rechazo...

source: Changes Comments
es: Comentarios sobre Cambios

# changesCommentsHint
source: Enter changes comments
es: Especifica los cambios necesarios (obligatorio)

source: Confirm Approval
es: Confirmar Aprobación

source: Confirm Rejection
es: Confirmar Rechazo

source: Confirm Changes
es: Confirmar Solicitud de Cambios

# approvalConfirmMessage
source: Are you sure you want to approve this anteproyecto?
es: ¿Estás seguro de que quieres aprobar este anteproyecto?

# rejectionConfirmMessage
source: Are you sure you want to reject this anteproyecto?
es: ¿Estás seguro de que quieres rechazar este anteproyecto?

# changesConfirmMessage
source: Are you sure you want to request changes for this anteproyecto?
es: ¿Estás seguro de que quieres solicitar cambios en este anteproyecto?

# approvalSuccess
source: Anteproject approved successfully
es: Anteproyecto aprobado exitosamente

# rejectionSuccess
source: Anteproject rejected successfully
es: Anteproyecto rechazado exitosamente

# changesSuccess
source: Changes requested successfully
es: Cambios solicitados exitosamente

# approvalError
source: Error processing approval
es: Error al procesar la aprobación

# noAnteprojectsToReview
source: No anteproyectos to review
es: No hay anteproyectos para revisar

# noReviewedAnteprojects
source: No reviewed anteproyectos
es: No hay anteproyectos revisados

source: Submitted on
es: Enviado el

source: Reviewed on
es: Revisado el

source: Tutor Comments
es: Comentarios del Tutor

source: Anteproject Status
es: Estado del Anteproyecto

source: View details
es: Ver detalles

source: Processing...
es: Procesando...

# commentsRequired
source: Comments are required
es: Los comentarios son obligatorios

source: Approve
es: Aprobar

source: Reject
es: Rechazar

source: Refresh
es: Actualizar

source: Retry
es: Reintentar

source: Academic Year
es: Año Académico

# noDataDescription
source: No data available
es: No hay información para mostrar en este momento

source: Upload File
es: Subir Archivo

source: Uploading...
es: Subiendo...

source: Upload
es: Subir

source: File uploaded successfully
es: Archivo subido correctamente

source: File deleted successfully
es: Archivo eliminado correctamente

# confirmDeleteFile
source: Confirm Delete
es: Confirmar Eliminación

# confirmDeleteFileMessage
source: Are you sure you want to delete this file?
es: ¿Estás seguro de que deseas eliminar el archivo {fileName}?

source: Open File
es: Abrir Archivo

source: Delete File
es: Eliminar Archivo

source: No files attached
es: No hay archivos adjuntos

source: No files yet
es: Aún no hay archivos

source: Uploaded by
es: Subido por

# clickToSelectFile
source: Click to select a file
es: Haz clic para seleccionar un archivo

source: Allowed file types
es: Tipos permitidos: PDF, Word, TXT, Imágenes (JPG, PNG, GIF), ZIP, RAR

# maxFileSize
source: Maximum file size
es: Tamaño máximo: {size}

source: Files Attached
es: Archivos Adjuntos

source: Attach File
es: Adjuntar Archivo

source: Task Details
es: Detalles de la Tarea

source: Details
es: Detalles

source: Add Students
es: Añadir Estudiantes

# studentsAssignedInfo
source: You have {count} student{plural} assigned for {year}
es: Tienes {count} estudiante{plural} asignado{plural} para {year}

source: My Students
es: Mis Estudiantes

source: Search students...
es: Buscar estudiantes...

# noStudentsAssigned
source: You have no students assigned
es: No tienes estudiantes asignados

source: No students found
es: No se encontraron estudiantes

# useDashboardButtons
source: Use the dashboard buttons to add students
es: Usa los botones del dashboard para añadir estudiantes

# editStudent
source: Edit
es: Editar

# deleteStudent
source: Delete
es: Eliminar

source: Phone
es: Teléfono

source: Specialty
es: Especialidad

source: Biography
es: Biografía

source: Creation date
es: Fecha de creación

# studentDeletedSuccess
source: Student deleted successfully
es: Estudiante eliminado exitosamente

# errorDeletingStudent
source: Error deleting student: {error}
es: Error al eliminar estudiante: {error}

source: Confirm deletion
es: Confirmar eliminación

# confirmDeleteStudent
source: Are you sure you want to delete {name}?
es: ¿Estás seguro de que quieres eliminar a {name}?

source: Anteprojects Review
es: Revisión de Anteproyectos

# pendingAnteprojectsTitle
source: Pending Anteprojects
es: Anteproyectos Pendientes

# reviewedAnteprojectsTitle
source: Reviewed Anteprojects
es: Anteproyectos Revisados

source: Submitted Anteprojects
es: Anteproyectos Enviados

source: Under Review Anteprojects
es: Anteproyectos En Revisión

source: Approved Anteprojects
es: Anteproyectos Aprobados

source: Rejected Anteprojects
es: Anteproyectos Rechazados

source: All
es: Todos

# searchAnteprojects
source: Search anteproyectos...
es: Buscar anteproyectos...

source: Filter by status:
es: Filtrar por estado:

# errorLoadingAnteprojects
source: Error loading anteproyectos: {error}
es: Error al cargar anteproyectos: {error}

# noAnteprojectsFound
source: No anteproyectos found matching \
es: No se encontraron anteproyectos que coincidan con "{query}"

# noAnteprojectsWithStatus
source: No anteproyectos with status \
es: No hay anteproyectos con estado "{status}"

# noAssignedAnteprojects
source: You have no anteproyectos assigned for review
es: No tienes anteproyectos asignados para revisar

source: Clear filters
es: Limpiar filtros

source: Year
es: Año:

source: Created:
es: Creado:

source: Last update:
es: Última actualización:

source: Dates
es: Fechas

source: Review Dates
es: Fechas de Revisión

source: Project Milestones
es: Hitos del Proyecto

source: Comments
es: Comentarios

# approveAnteprojectTitle
source: Approve Anteproject
es: Aprobar Anteproyecto

# rejectAnteprojectTitle
source: Reject Anteproject
es: Rechazar Anteproyecto

# confirmApproveAnteproject
source: Are you sure you want to approve this anteproject?
es: ¿Estás seguro de que quieres aprobar este anteproyecto?

# confirmRejectAnteproject
source: Are you sure you want to reject this anteproject?
es: ¿Estás seguro de que quieres rechazar este anteproyecto?

# approvalCommentsOptional
source: Comments (optional)
es: Comentarios (opcional)

# anteprojectApprovedSuccess
source: Anteproject approved successfully
es: Anteproyecto aprobado exitosamente

# anteprojectRejectedSuccess
source: Anteproject rejected
es: Anteproyecto rechazado

# errorApprovingAnteproject
source: Error approving anteproyecto: {error}
es: Error al aprobar anteproyecto: {error}

# errorRejectingAnteproject
source: Error rejecting anteproyecto: {error}
es: Error al rechazar anteproyecto: {error}

source: Pending
es: Pendiente

source: Under Review
es: En Revisión

source: Approved
es: Aprobado

source: Rejected
es: Rechazado

source: Status
es: Estado

# anteprojectTitleLabel
source: Anteproject Title
es: Título del Anteproyecto

# logoutTooltip
source: Logout
es: Cerrar sesión

source: Quick Access
es: Acceso Rápido

source: Files
es: Archivos

source: Recent Activity
es: Actividad Reciente

# welcomeMessage
source: Welcome!
es: ¡Bienvenido!

# welcomeDescription
source: You have logged in successfully
es: Has iniciado sesión correctamente

source: Get Started
es: Comenzar

# getStartedDescription
source: Use the side menu to navigate
es: Usa el menú lateral para navegar

# createAnteprojectTooltip
source: Create anteproyecto
es: Crear anteproyecto

# studentRole
source: Student
es: Estudiante

source: Anteprojects
es: Anteproyectos

source: Completed
es: Completadas

# anteprojectApprovedMessage
source: Anteproject approved successfully
es: Tu anteproyecto ha sido aprobado. ¡Puedes comenzar con el desarrollo!

# academicYearLabel
source: Academic Year
es: Año: {year}

# statusLabel
source: Status
es: Estado: {status}

source: Draft
es: Borrador

# approvedStatus
source: Approved
es: Aprobado

# rejectedStatus
source: Rejected
es: Rechazado

source: Unknown
es: Desconocido

source: In Progress
es: En Progreso

# completedStatus
source: Completed
es: Completada

# unknownStatus
source: Unknown
es: Desconocido

# studentCreatedSuccess
source: Student created successfully
es: Alumno creado exitosamente

# errorCreatingStudent
source: Error creating student: {error}
es: Error al crear estudiante: {error}

source: Add Student
es: Añadir Estudiante

source: Full Name
es: Nombre Completo

# nreLabel
source: NRE (Student Registration Number)
es: NRE (Número de Registro de Estudiante)

source: Phone (Optional)
es: Teléfono (Opcional)

source: Biography (Optional)
es: Biografía (Opcional)

# nameRequired
source: Name is required
es: El nombre es obligatorio

# emailRequired
source: Email is required
es: El email es obligatorio

# emailInvalid
source: Invalid email
es: Email inválido

# nreRequired
source: NRE is required
es: El NRE es obligatorio

source: Create Student
es: Crear Estudiante

# studentUpdatedSuccess
source: Student updated successfully
es: Estudiante actualizado exitosamente

# errorUpdatingStudent
source: Error updating student: {error}
es: Error al actualizar estudiante: {error}

source: Update Student
es: Actualizar Estudiante

source: Role
es: Rol

# noProjectAssigned
source: You don't have a project or anteproject assigned. Contact your tutor.
es: No tienes un proyecto o anteproyecto asignado. Contacta con tu tutor.

# errorGettingProject
source: Error getting project: {error}
es: Error al obtener proyecto: {error}

source: Delete Anteproject
es: Eliminar Anteproyecto

# confirmDeleteAnteproject
source: Are you sure you want to delete the anteproject \
es: ¿Estás seguro de que quieres eliminar el anteproyecto "{title}"? Esta acción no se puede deshacer.

# anteprojectDeletedSuccess
source: Anteproject deleted successfully
es: Anteproyecto eliminado exitosamente

# errorDeletingAnteproject
source: Error deleting anteproject: {error}
es: Error al eliminar anteproyecto: {error}

# templateLoadedSuccess
source: ✅ Template loaded successfully. 4 example milestones have been added.
es: ✅ Plantilla cargada correctamente. Los 4 hitos de ejemplo han sido añadidos.

# errorGeneratingPDF
source: Error generating PDF: {error}
es: Error al generar PDF: {error}
