Repository: elmosca/proyecto_flutter_supabase
Catalog: frontend/lib/l10n/app_*.arb
Languages: es

# downloadExampleTitle
source: Download Anteproject Example
es: Descargar Ejemplo de Anteproyecto

# downloadExampleMessage
source: How would you like to download the anteproject example?
es: ¿Cómo deseas descargar el ejemplo de anteproyecto?

source: Print
es: Imprimir

# pdfSavedAt
source: PDF saved at: {path}
es: PDF guardado en: {path}

# errorSaving
source: Error saving: {error}
es: Error al guardar: {error}

source: Download Example PDF
es: Descargar Ejemplo PDF

# errorLoadingSchedule
source: Error loading schedule: {error}
es: Error al cargar cronograma: {error}

# mustConfigureReviewDate
source: You must configure at least one review date
es: Debe configurar al menos una fecha de revisión

# scheduleSavedSuccess
source: Schedule saved successfully
es: Cronograma guardado exitosamente

# errorSavingSchedule
source: Error saving schedule: {error}
es: Error al guardar cronograma: {error}

source: Schedule Management
es: Gestión de Cronograma

source: Regenerate Dates Based on Milestones
es: Regenerar Fechas Basadas en Hitos

source: No milestones defined
es: No se han definido hitos

source: Anteproject Details
es: Detalles del Anteproyecto

source: Edit Anteproject
es: Editar Anteproyecto

source: Anteproject rejected
es: Anteproyecto rechazado

source: Send for Approval
es: Enviar para Aprobación

# sendForApprovalTitle
source: Send for Approval
es: Enviar para Aprobación

# sendForApprovalMessage
source: Are you sure you want to send this anteproject for approval? Once sent, you won't be able to edit it until it's reviewed.
es: ¿Estás seguro de que quieres enviar este anteproyecto para aprobación? Una vez enviado, no podrás editarlo hasta que sea revisado.

source: Send
es: Enviar

# anteprojectSentForApproval
source: Anteproject sent for approval successfully
es: Anteproyecto enviado para aprobación exitosamente

# errorSendingAnteproject
source: Error sending anteproject: {error}
es: Error al enviar anteproyecto: {error}

# anteprojectTitle
source: Anteproject
es: Anteproyecto: {title}

# errorLoadingComments
source: Error loading comments: {error}
es: Error al cargar comentarios: {error}

# pleaseWriteComment
source: Please write a comment
es: Por favor, escribe un comentario

# commentAddedSuccess
source: Comment added successfully
es: Comentario agregado exitosamente

# errorAddingComment
source: Error adding comment: {error}
es: Error al agregar comentario: {error}

# commentsTitle
source: Comments
es: Comentarios - {title}

source: Copied
es: Copiado: {text}

source: Add Individually
es: Añadir Individualmente

source: Import from CSV
es: Importar desde CSV

# errorLoadingNotifications
source: Error loading notifications: {error}
es: Error al cargar notificaciones: {error}

# errorMarkingAsRead
source: Error marking as read: {error}
es: Error marcando como leída: {error}

source: All notifications marked as read
es: Todas las notificaciones marcadas como leídas

# errorMarkingAllAsRead
source: Error marking all as read: {error}
es: Error al marcar todas como leídas: {error}

# errorDeletingNotification
source: Error deleting notification: {error}
es: Error al eliminar notificación: {error}

source: Notifications
es: Notificaciones

# errorLoadingStudents
source: Error loading students: {error}
es: Error al cargar estudiantes: {error}

source: All years
es: Todos los años

# errorSelectingFile
source: Error selecting file: {error}
es: Error al seleccionar archivo: {error}

source: No valid data to import
es: No hay datos válidos para importar

# importCompleted
source: Import completed: {success} successful, {error} errors
es: Importación completada: {success} exitosos, {error} errores

# errorDuringImport
source: Error during import: {error}
es: Error durante la importación: {error}

source: Import Students CSV
es: Importar Estudiantes CSV

source: • full_name (required)
es: • full_name (obligatorio)

source: • specialty (optional)
es: • specialty (opcional)

source: • academic_year (optional)
es: • academic_year (opcional)

source: Select CSV File
es: Seleccionar Archivo CSV

# importStudents
source: Import {count} Students
es: Importar {count} Estudiantes

source: Importing...
es: Importando...

# studentsImportedSuccess
source: Students imported successfully
es: Estudiantes importados exitosamente

source: Creating...
es: Creando...

source: Create Tutor
es: Crear Tutor

# tutorCreatedSuccess
source: Tutor created successfully
es: Tutor creado exitosamente

# errorUploadingFile
source: Error uploading file: {error}
es: Error al subir archivo: {error}

# errorLoadingFiles
source: Error loading files: {error}
es: Error al cargar archivos: {error}

# errorDeletingFile
source: Error deleting file: {error}
es: Error al eliminar archivo: {error}

# errorOpeningFile
source: Error opening file: {error}
es: Error al abrir archivo: {error}

source: Estimated Hours
es: {hours}h

# confirmDeleteTask
source: Are you sure you want to delete the task \
es: ¿Estás seguro de que quieres eliminar la tarea "{title}"?

# mustLoginToViewComments
source: You must login to view comments
es: Debes iniciar sesión para ver los comentarios

# permissionRequired
source: Permissions Required
es: Permisos Requeridos

# permissionRequiredMessage
source: This application needs access to storage to select files. Please grant the necessary permissions.
es: Esta aplicación necesita acceso al almacenamiento para seleccionar archivos. Por favor, concede los permisos necesarios.

source: Open Settings
es: Abrir Configuración

source: Try Again
es: Intentar de Nuevo

source: File saved successfully
es: Archivo guardado con éxito

# errorPrinting
source: Error printing: {error}
es: Error al imprimir: {error}

# selectProjectForTasks
source: Select project
es: Selecciona el proyecto

source: Project Details
es: Detalles del Proyecto

# anteprojectHistoryComments
source: Anteproject Comments (Historical)
es: Comentarios del Anteproyecto (Histórico)

source: Project Comments
es: Comentarios del Proyecto

source: Attached Files
es: Archivos Adjuntos

source: Kanban Board
es: Tablero Kanban

# kanbanOnlyForProjects
source: The Kanban board is only available for approved projects
es: El tablero Kanban solo está disponible para proyectos aprobados

# anteprojectNotFound
source: The anteproject associated with the project was not found
es: No se encontró el anteproyecto asociado al proyecto

source: Tasks List
es: Lista de Tareas

# errorNetworkTimeout
source: The connection timed out. Please check your internet connection and try again.
es: La conexión tardó demasiado. Por favor, verifica tu conexión a internet e inténtalo de nuevo.

# errorNetworkNoInternet
source: No internet connection. Please check your connection and try again.
es: No hay conexión a internet. Por favor, verifica tu conexión e inténtalo de nuevo.

# errorNetworkServerUnavailable
source: The server is not available at this time. Please try again later.
es: El servidor no está disponible en este momento. Por favor, inténtalo más tarde.

# errorNetworkDnsError
source: Could not resolve server address. Check your internet connection.
es: No se pudo resolver la dirección del servidor. Verifica tu conexión a internet.

# errorNetworkConnectionLost
source: Connection lost. Please check your internet connection.
es: Se perdió la conexión. Por favor, verifica tu conexión a internet.

# errorNetworkRequestFailed
source: The request failed. Please try again.
es: La solicitud falló. Por favor, inténtalo de nuevo.

# errorNotAuthenticated
source: You must be logged in to perform this action.
es: Debes iniciar sesión para realizar esta acción.

# errorInvalidCredentials
source: Invalid credentials. Please check your email and password.
es: Las credenciales son incorrectas. Por favor, verifica tu email y contraseña.

# errorSessionExpired
source: Your session has expired. Please log in again.
es: Tu sesión ha expirado. Por favor, inicia sesión nuevamente.

# errorProfileNotFound
source: Could not find your user profile. Please contact support.
es: No se pudo encontrar tu perfil de usuario. Por favor, contacta con soporte.

# errorAccountDisabled
source: Your account is disabled. Please contact the administrator.
es: Tu cuenta está deshabilitada. Por favor, contacta con el administrador.

# errorEmailNotVerified
source: Your email has not been verified. Please check your inbox.
es: Tu email no ha sido verificado. Por favor, revisa tu bandeja de entrada.

# errorPasswordTooWeak
source: Password is too weak. Must be at least 8 characters.
es: La contraseña es demasiado débil. Debe tener al menos 8 caracteres.

# errorLoginAttemptsExceeded
source: Too many login attempts. Please try again later.
es: Demasiados intentos de inicio de sesión. Inténtalo más tarde.

# errorRateLimitExceeded
source: Too many requests. For security purposes, you must wait a few seconds before creating another user. Please wait a moment and try again.
es: Demasiadas solicitudes. Por seguridad, debes esperar unos segundos antes de intentar crear otro usuario. Por favor, espera un momento e inténtalo de nuevo.

# errorRateLimitEmailSent
source: Rate limit reached. If a verification email was sent but the user was not fully created, the administrator will need to manually clean up the user from Supabase Dashboard.
es: Se ha alcanzado el límite de solicitudes. Si se envió un email de verificación pero el usuario no se creó completamente, el administrador deberá limpiar manualmente el usuario desde Supabase Dashboard.

# errorEmailAlreadyRegistered
source: This email is already registered. If you recently deleted a user with this email, please wait a few minutes before trying to create another user with the same email. Supabase requires a waiting period before allowing email reuse.
es: Este correo electrónico ya está registrado. Si acabas de eliminar un usuario con este correo, por favor espera unos minutos antes de intentar crear otro usuario con el mismo email. Supabase requiere un período de espera antes de permitir reutilizar un email.

# errorFieldRequired
source: This field is required.
es: Este campo es obligatorio.

# errorFieldTooShort
source: This field is too short.
es: Este campo es demasiado corto.

# errorFieldTooLong
source: This field is too long.
es: Este campo es demasiado largo.

# errorInvalidEmail
source: Invalid email format.
es: El formato del email no es válido.

# errorInvalidUrl
source: Invalid URL format.
es: La URL no tiene un formato válido.

# errorInvalidNumber
source: Value must be a valid number.
es: El valor debe ser un número válido.

# errorInvalidJson
source: Invalid JSON format.
es: El formato JSON no es válido.

# errorInvalidDate
source: Invalid date format.
es: La fecha no tiene un formato válido.

# errorInvalidFileType
source: File type not allowed.
es: El tipo de archivo no está permitido.

# errorInvalidFileSize
source: File is too large.
es: El archivo es demasiado grande.

# errorMissingTaskContext
source: Must select a project to create the task.
es: Debe seleccionar un proyecto para crear la tarea.

# errorInvalidProjectRelation
source: Invalid project relation.
es: La relación con el proyecto no es válida.

# errorAccessDenied
source: You don't have permission to perform this action.
es: No tienes permisos para realizar esta acción.

# errorInsufficientPermissions
source: You don't have sufficient permissions to perform this action.
es: No tienes suficientes permisos para realizar esta acción.

# errorOperationNotAllowed
source: This operation is not allowed.
es: Esta operación no está permitida.

# errorResourceNotFound
source: The requested resource was not found.
es: El recurso solicitado no fue encontrado.

# errorCannotDeleteCompletedTask
source: Cannot delete a completed task.
es: No se puede eliminar una tarea completada.

# errorCannotEditApprovedAnteproject
source: Cannot edit an approved anteproject.
es: No se puede editar un anteproyecto aprobado.

# errorDatabaseConnectionFailed
source: Could not connect to database. Please try again later.
es: No se pudo conectar a la base de datos. Inténtalo más tarde.

# errorDatabaseQueryFailed
source: Database query failed. Please try again.
es: La consulta a la base de datos falló. Inténtalo de nuevo.

# errorDatabaseConstraintViolation
source: Data does not comply with database rules.
es: Los datos no cumplen con las reglas de la base de datos.

# errorDatabaseDuplicateEntry
source: A record with this data already exists.
es: Ya existe un registro con estos datos.

# errorDatabaseForeignKeyViolation
source: Cannot perform operation due to data dependencies.
es: No se puede realizar la operación debido a dependencias de datos.

# errorDatabaseUnknownError
source: A database error occurred. Please try again later.
es: Ocurrió un error en la base de datos. Inténtalo más tarde.

# errorDatabaseTimeout
source: Operation timed out. Please try again.
es: La operación tardó demasiado. Inténtalo de nuevo.

# errorFileUploadFailed
source: Could not upload file. Please try again.
es: No se pudo subir el archivo. Inténtalo de nuevo.

# errorFileDownloadFailed
source: Could not download file. Please try again.
es: No se pudo descargar el archivo. Inténtalo de nuevo.

# errorFileDeleteFailed
source: Could not delete file. Please try again.
es: No se pudo eliminar el archivo. Inténtalo de nuevo.

# errorFileNotFound
source: File not found.
es: El archivo no fue encontrado.

# errorFileSizeExceeded
source: File is too large. Maximum size is {maxSize}.
es: El archivo es demasiado grande. El tamaño máximo es {maxSize}.

# errorFileTypeNotAllowed
source: File type not allowed. Allowed types: {allowedTypes}.
es: El tipo de archivo no está permitido. Tipos permitidos: {allowedTypes}.

# errorFileCorrupted
source: File is corrupted or damaged.
es: El archivo está corrupto o dañado.

# errorFilePermissionDenied
source: You don't have permission to access this file.
es: No tienes permisos para acceder a este archivo.

# errorInvalidState
source: Current state does not allow this operation.
es: El estado actual no permite realizar esta operación.

# errorOperationNotSupported
source: This operation is not supported.
es: Esta operación no está soportada.

# errorResourceAlreadyExists
source: A resource with this data already exists.
es: Ya existe un recurso con estos datos.

# errorResourceInUse
source: Resource is being used and cannot be modified.
es: El recurso está siendo utilizado y no se puede modificar.

# errorWorkflowViolation
source: This operation is not allowed in the current workflow.
es: Esta operación no está permitida en el flujo actual.

# errorBusinessRuleViolation
source: Operation violates a business rule.
es: La operación viola una regla de negocio.

# errorQuotaExceeded
source: You have exceeded the allowed limit.
es: Has excedido el límite permitido.

# errorDeadlineExceeded
source: Deadline has been exceeded.
es: Se ha excedido el plazo límite.

# errorConfigurationMissing
source: Required configuration is missing. Contact support.
es: Falta configuración requerida. Contacta con soporte.

# errorConfigurationInvalid
source: Configuration is invalid. Contact support.
es: La configuración no es válida. Contacta con soporte.

# errorServiceUnavailable
source: Service is not available. Please try again later.
es: El servicio no está disponible. Inténtalo más tarde.

# errorMaintenanceMode
source: System is under maintenance. Please try again later.
es: El sistema está en mantenimiento. Inténtalo más tarde.

# errorExternalServiceTimeout
source: External service took too long to respond.
es: El servicio externo tardó demasiado en responder.

# errorExternalServiceError
source: External service is not working properly.
es: El servicio externo no está funcionando correctamente.

# errorEmailServiceUnavailable
source: Email service is not available.
es: El servicio de email no está disponible.

# errorNotificationServiceUnavailable
source: Notification service is not available.
es: El servicio de notificaciones no está disponible.

# errorUnknown
source: An unexpected error occurred. Please try again.
es: Ha ocurrido un error inesperado. Por favor, inténtalo de nuevo.

# errorUnexpected
source: An unexpected error occurred. Please try again.
es: Ha ocurrido un error inesperado. Por favor, inténtalo de nuevo.

# errorInternal
source: An internal error occurred. Please contact support.
es: Ha ocurrido un error interno. Por favor, contacta con soporte.

# errorNetworkGeneric
source: Connection error. Please check your internet connection.
es: Error de conexión. Por favor, verifica tu conexión a internet.

# errorAuthenticationGeneric
source: Authentication error. Please log in again.
es: Error de autenticación. Por favor, inicia sesión nuevamente.

# errorValidationGeneric
source: Validation error. Please check the entered data.
es: Error de validación. Por favor, revisa los datos ingresados.

# errorPermissionGeneric
source: You don't have permission to perform this action.
es: No tienes permisos para realizar esta acción.

# errorDatabaseGeneric
source: Database error. Please try again later.
es: Error de base de datos. Inténtalo más tarde.

# errorFileGeneric
source: File error. Please try again.
es: Error de archivo. Inténtalo de nuevo.

# errorBusinessLogicGeneric
source: Business logic error. Operation cannot be completed.
es: Error de lógica de negocio. La operación no se puede completar.

# errorConfigurationGeneric
source: Configuration error. Contact support.
es: Error de configuración. Contacta con soporte.

# errorExternalServiceGeneric
source: External service error. Please try again later.
es: Error de servicio externo. Inténtalo más tarde.

# errorTitleNetwork
source: Connection Error
es: Error de Conexión

# errorTitleAuthentication
source: Authentication Error
es: Error de Autenticación

# errorTitleValidation
source: Validation Error
es: Error de Validación

# errorTitlePermission
source: Permission Error
es: Error de Permisos

# errorTitleDatabase
source: Database Error
es: Error de Base de Datos

# errorTitleFile
source: File Error
es: Error de Archivo

# errorTitleBusinessLogic
source: Business Logic Error
es: Error de Lógica de Negocio

# errorTitleConfiguration
source: Configuration Error
es: Error de Configuración

# errorTitleExternalService
source: External Service Error
es: Error de Servicio Externo

# errorTitleUnknown
source: Unknown Error
es: Error Desconocido

# errorActionNetwork
source: Check internet connection
es: Verificar conexión a internet

# errorActionAuthentication
source: Log in again
es: Iniciar sesión nuevamente

# errorActionValidation
source: Review entered data
es: Revisar los datos ingresados

# errorActionPermission
source: Contact administrator
es: Contactar con el administrador

# errorActionDatabase
source: Try again later
es: Intentar más tarde

# errorActionFile
source: Select another file
es: Seleccionar otro archivo

# errorActionBusinessLogic
source: Check resource state
es: Verificar el estado del recurso

# errorActionConfiguration
source: Contact technical support
es: Contactar con soporte técnico

# errorActionExternalService
source: Try again later
es: Intentar más tarde

# errorActionUnknown
source: Try again or contact support
es: Intentar de nuevo o contactar soporte

# forgotPassword
source: Forgot your password?
es: ¿Olvidaste tu contraseña?

source: Reset Password
es: Restablecer Contraseña

# resetPasswordInstructions
source: Enter your new password to restore access to your account.
es: Ingresa tu nueva contraseña para restablecer el acceso a tu cuenta.

# resetPasswordRequestSent
source: Request sent to your tutor
es: Solicitud enviada a tu tutor

# resetPasswordRequestSentDescription
source: Your tutor {tutorName} will receive a notification to generate a new temporary password. We will send you an email with the new password once your tutor has generated it.
es: Tu tutor {tutorName} recibirá una notificación para generar una nueva contraseña temporal. Te enviaremos un email con la nueva contraseña una vez que tu tutor la haya generado.

# userNotFound
source: No user found with that email
es: No se encontró un usuario con ese email

source: Set Up Password
es: Establecer Contraseña

# setupPasswordInstructions
source: Set your personal password to access the system. This will be your login password.
es: Establece tu contraseña personal para acceder al sistema. Esta será tu contraseña de acceso.

source: Send Reset Link
es: Enviar Enlace de Recuperación

# resetLinkSent
source: A password reset link has been sent to your email address.
es: Se ha enviado un enlace de recuperación a tu correo electrónico.

source: New Password
es: Nueva Contraseña

source: Confirm New Password
es: Confirmar Nueva Contraseña

source: Change Password
es: Cambiar Contraseña

# passwordChanged
source: Password updated successfully
es: Contraseña actualizada exitosamente

source: Passwords do not match
es: Las contraseñas no coinciden

# passwordTooShort
source: Password must be at least 6 characters
es: La contraseña debe tener al menos 6 caracteres

# passwordRequired
source: Password is required
es: La contraseña es obligatoria

# userCreatedSuccess
source: User created successfully. A verification email has been sent.
es: Usuario creado exitosamente. Se ha enviado un email de verificación.

# userCreatedInstructions
source: The user will receive a verification email. After verifying their email, they must use the 'Forgot your password?' option to set their personal password.
es: El usuario recibirá un email de verificación. Después de verificar su email, deberá usar la opción '¿Olvidaste tu contraseña?' para establecer su contraseña personal.

# resetPasswordForStudent
source: Reset password for {studentName}
es: Restablecer contraseña para {studentName}

source: Generate password automatically
es: Generar contraseña automáticamente

# regeneratePassword
source: Regenerate
es: Regenerar

# passwordResetSuccess
source: Password reset successfully
es: Contraseña restablecida exitosamente

# passwordResetNotificationSent
source: A notification has been sent to the student with the new password.
es: Se ha enviado una notificación al estudiante con la nueva contraseña.

# passwordResetError
source: Error resetting password: {error}
es: Error al resetear contraseña: {error}

# studentCreatedWithPassword
source: The student has been created with the password set. They can log in immediately.
es: El estudiante ha sido creado con la contraseña establecida. Puede iniciar sesión inmediatamente.

source: Messages
es: Mensajes

# tutorMessages
source: Student Messages
es: Mensajes de Estudiantes

# studentMessages
source: Messages with Tutor
es: Mensajes con el Tutor

# helpGuide
source: User Guide
es: Guía de Uso

source: System Settings
es: Configuración del Sistema

source: Settings
es: Configuración

# selectProjectOrAnteprojectMessage
source: Select a project or anteproject to view or respond to messages from your students
es: Selecciona un proyecto o anteproyecto para ver o responder mensajes de tus estudiantes

# waitForStudentsAssignment
source: Wait for students to be assigned to you with projects or anteprojects
es: Espera a que te asignen estudiantes con proyectos o anteproyectos

source: All types
es: Todos los tipos

source: Filter by type
es: Filtrar por tipo

source: Mark all as read
es: Marcar todas como leídas

source: My Notifications
es: Mis Notificaciones

source: System
es: Sistema

source: Notification deleted
es: Notificación eliminada

# errorDeleting
source: Error deleting: {error}
es: Error eliminando: {error}

source: No notifications
es: No hay notificaciones

source: No notifications of this type
es: No hay notificaciones de este tipo
