Repository: elmosca/proyecto_flutter_supabase
Catalog: frontend/lib/l10n/app_*.arb
Languages: es

# privateCommunicationsPrivacy
source: Private communications between users are not shown for data protection.
es: Las comunicaciones privadas entre usuarios no se muestran por protección de datos.

source: View messages
es: Ver mensajes

source: Update
es: Actualizar

source: Update list
es: Actualizar lista

source: Update messages
es: Actualizar mensajes

source: Update comments
es: Actualizar comentarios

source: Now
es: Ahora

# agoDays
source: {days} day ago
es: Hace {days} día

# agoDaysPlural
source: {days} days ago
es: Hace {days} días

# agoHours
source: {hours} hour ago
es: Hace {hours} hora

# agoHoursPlural
source: {hours} hours ago
es: Hace {hours} horas

# agoMinutes
source: {minutes} minute ago
es: Hace {minutes} minuto

# agoMinutesPlural
source: {minutes} minutes ago
es: Hace {minutes} minutos

# agoDaysShort
source: {days}d ago
es: Hace {days}d

# agoHoursShort
source: {hours}h ago
es: Hace {hours}h

# agoMinutesShort
source: {minutes}m ago
es: Hace {minutes}m

# projectQueriesMessage
source: Here you can ask questions about your project
es: Aquí puedes hacer consultas sobre tu proyecto

# anteprojectQueriesMessage
source: Here you can ask questions about your anteproject
es: Aquí puedes hacer consultas sobre tu anteproyecto

# selectProjectOrAnteprojectToStartConversation
source: Select a project or anteproject to start or continue a conversation with your tutor
es: Selecciona un proyecto o anteproyecto para iniciar o continuar una conversación con tu tutor

# noActiveProjects
source: You have no active projects
es: No tienes proyectos activos

# createAnteprojectToChat
source: Create an anteproject to chat with your tutor
es: Crea un anteproyecto para poder conversar con tu tutor

source: Approved Projects
es: Proyectos Aprobados

source: Project in development
es: Proyecto en desarrollo

source: View comments
es: Ver comentarios

source: Manage Schedule
es: Gestionar Cronograma

source: New User
es: Nuevo Usuario

source: User Deleted
es: Usuario Eliminado

source: System Error
es: Error del Sistema

source: Security Alert
es: Alerta de Seguridad

source: Settings Changed
es: Configuración Cambiada

source: Backup Completed
es: Copia de Seguridad

source: Bulk Operation
es: Operación Masiva

# systemMaintenance
source: Maintenance
es: Mantenimiento

source: Announcement
es: Anuncio

source: System Notification
es: Notificación del Sistema

source: Comment
es: Comentario

source: Message in Anteproject
es: Mensaje en Anteproyecto

source: Message in Project
es: Mensaje en Proyecto

source: Password Reset Request
es: Solicitud de Restablecimiento

source: Task Assigned
es: Tarea Asignada

source: Status Changed
es: Estado Cambiado

source: Conversations
es: Conversaciones

source: New topic
es: Nuevo tema

# writeMessage
source: Write a message...
es: Escribe un mensaje...

source: No conversations yet
es: No hay conversaciones aún

# createNewTopicToStart
source: Create a new topic to start chatting with your tutor
es: Crea un nuevo tema para empezar a conversar con tu tutor

# useButtonBelow
source: 👇 Use the button below 👇
es: 👇 Usa el botón de abajo 👇

# errorLoadingConversations
source: Error loading conversations: {error}
es: Error al cargar conversaciones: {error}

source: New conversation topic
es: Nuevo tema de conversación

# createNewTopicToOrganize
source: Create a new topic to organize your conversation with the tutor.
es: Crea un nuevo tema para organizar tu conversación con el tutor.

source: Topic title
es: Título del tema

# topicTitleHint
source: E.g.: Questions about methodology
es: Ej: Dudas sobre la metodología

# topicTitleHelper
source: Briefly describe the topic to discuss
es: Describe brevemente el tema a tratar

# pleaseEnterTitle
source: Please enter a title
es: Por favor ingresa un título

# titleMinLength
source: Title must be at least 3 characters
es: El título debe tener al menos 3 caracteres

# topicTitleTip
source: Tip: Use descriptive titles like "Questions Ch. 3" or "Code review"
es: Tip: Usa títulos descriptivos como "Dudas Cap. 3" o "Revisión de código"

source: Create topic
es: Crear tema

# errorSendingMessage
source: Error sending message: {error}
es: Error al enviar mensaje: {error}

source: No comments yet
es: No hay comentarios aún

# beFirstToComment
source: Be the first to comment on this anteproject
es: Sé el primero en comentar este anteproyecto

# commentsWillAppearHere
source: Comments will appear here when the tutor adds them
es: Los comentarios aparecerán aquí cuando el tutor los agregue

# viewMoreComments
source: View {count} more comments
es: Ver {count} comentarios más

source: Internal
es: Interno

# editedOn
source: Edited on {date}
es: Editado el {date}

source: Section:
es: Sección:

# internalCommentLabel
source: Internal comment (only visible to tutors)
es: Comentario interno (solo visible para tutores)

source: Comment added successfully
es: Comentario agregado exitosamente

# sectionDescription
source: Description
es: Descripción

# sectionObjectives
source: Objectives
es: Objetivos

# sectionExpectedResults
source: Expected Results
es: Resultados Esperados

# sectionTimeline
source: Timeline
es: Temporalización

# sectionMethodology
source: Methodology
es: Metodología

# sectionResources
source: Resources
es: Recursos

# sectionOther
source: Other
es: Otros

source: General Information
es: Información General
